; ###### Techs ######

[BasicAutoLoader X2TechTemplate]
DisplayName="Basic Auto-Loader"
Summary="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to."

[AdvancedAutoLoader X2TechTemplate]
DisplayName="Advanced Auto-Loader"
Summary="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to."

[SuperiorAutoLoader X2TechTemplate]
DisplayName="Superior Auto-Loader"
Summary="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to."

[BasicExpandedMagazine X2TechTemplate]
DisplayName="Basic Expanded Magazine"
Summary="This weapon upgrade will increase the ammunition count of any weapon it is attached to."

[AdvancedExpandedMagazine X2TechTemplate]
DisplayName="Advanced Expanded Magazine"
Summary="This weapon upgrade will increase the ammunition count of any weapon it is attached to."

[SuperiorExpandedMagazine X2TechTemplate]
DisplayName="Superior Expanded Magazine"
Summary="This weapon upgrade will increase the ammunition count of any weapon it is attached to."

[BasicHairTrigger X2TechTemplate]
DisplayName="Basic Hair Trigger"
Summary="This weapon upgrade, when installed, adds a small chance that any shot taken will not cost an action."

[AdvancedHairTrigger X2TechTemplate]
DisplayName="Advanced Hair Trigger"
Summary="This weapon upgrade, when installed, adds a small chance that any shot taken will not cost an action."

[SuperiorHairTrigger X2TechTemplate]
DisplayName="Superior Hair Trigger"
Summary="This weapon upgrade, when installed, adds a small chance that any shot taken will not cost an action."

[BasicLaserSight X2TechTemplate]
DisplayName="Basic Laser Sight"
Summary="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[AdvancedLaserSight X2TechTemplate]
DisplayName="Advanced Laser Sight"
Summary="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[SuperiorLaserSight X2TechTemplate]
DisplayName="Superior Laser Sight"
Summary="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[BasicRepeater X2TechTemplate]
DisplayName="Basic Repeater"
Summary="This weapon upgrade, when installed, adds a small chance that any successful shot will instantly kill the target, regardless of the target's remaining HP."

[AdvancedRepeater X2TechTemplate]
DisplayName="Advanced Repeater"
Summary="This weapon upgrade, when installed, adds a small chance that any successful shot will instantly kill the target, regardless of the target's remaining HP."

[SuperiorRepeater X2TechTemplate]
DisplayName="Superior Repeater"
Summary="This weapon upgrade, when installed, adds a small chance that any successful shot will instantly kill the target, regardless of the target's remaining HP."

[BasicScope X2TechTemplate]
DisplayName="Basic Scope"
Summary="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[AdvancedScope X2TechTemplate]
DisplayName="Advanced Scope"
Summary="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[SuperiorScope X2TechTemplate]
DisplayName="Superior Scope"
Summary="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[BasicStock X2TechTemplate]
DisplayName="Basic Stock"
Summary="This weapon upgrade, when installed, will guarantee that even missed shots will do a small amount of damage."

[AdvancedStock X2TechTemplate]
DisplayName="Advanced Stock"
Summary="This weapon upgrade, when installed, will guarantee that even missed shots will do a small amount of damage."

[SuperiorStock X2TechTemplate]
DisplayName="Superior Stock"
Summary="This weapon upgrade, when installed, will guarantee that even missed shots will do a small amount of damage."

; ###### Vanilla Override ######

; Basic Weapon Upgrades
[ReloadUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Auto-Loader"
FriendlyNamePlural="Basic Auto-Loaders"
BriefSummary="The first reload in a mission does not cost an action."
TinySummary="Free Reloads"
LootTooltip="This weapon upgrade will grant a limited number of free reloads to any weapon it is attached to."

[ClipSizeUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Expanded Magazine"
FriendlyNamePlural="Basic Expanded Magazines"
BriefSummary="Clip size is increased by <Ability:EXPMAGINCREASE/>."
TinySummary="Increased Clip Size"
LootTooltip="This weapon upgrade will increase the ammunition count of any weapon it is attached to."

[FreeFireUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Hair Trigger"
FriendlyNamePlural="Basic Hair Triggers"
BriefSummary="When firing, the soldier has a <Ability:HAIRTRIGGERCHANCE/>% chance that the shot will not cost an action for the active turn."
TinySummary="Bonus Action Chance"
LootTooltip="This weapon upgrade, when installed, adds a small chance that any shot taken will not cost an action."

[CritUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Laser Sight"
FriendlyNamePlural="Basic Laser Sights"
BriefSummary="Increase critical hit chance by +<Ability:CRITINCREASE/>%, improving even further with proximity to target."
TinySummary="Increased Crit Chance"
LootTooltip="This weapon upgrade will increase the critical hit chance of any weapon it is attached to."

[FreeKillUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Repeater"
FriendlyNamePlural="Basic Repeaters"
BriefSummary="A <Ability:FREEKILLCHANCE/>% chance to instantly kill your target when you hit them, regardless of the target's remaining HP."
TinySummary="Free Instant Kills"
LootTooltip="This weapon upgrade, when installed, adds a small chance that any successful shot will instantly kill the target, regardless of the target's remaining HP."

[AimUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Scope"
FriendlyNamePlural="Basic Scopes"
BriefSummary="Increase aim by +<Ability:SCOPEAIMINCREASE/>%."
TinySummary="Increased Aim"
LootTooltip="This weapon upgrade will add an aim bonus to any weapon it is attached to."

[MissDamageUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Stock"
FriendlyNamePlural="Basic Stocks"
BriefSummary="Missed shots still deal <Ability:MISSDAMAGEAMT/> damage to the target."
TinySummary="Missed Shots Do Damage"
LootTooltip="This weapon upgrade, when installed, will guarantee that even missed shots will do a small amount of damage."